app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "descrption de l'image"], ["user_id", 1], ["created_at", "2020-10-15 13:33:45.058222"], ["updated_at", "2020-10-15 13:33:45.058222"]]

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "Superbe image !!!"], ["updated_at", "2020-10-15 13:49:06.663264"], ["id", 2]]

  def destroy
    @post = Post.find(params[:id])
    if @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]